Обработки/Reports/_ДоходыИРасходыПенсионныхРезервов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ДоходыИРасходыПенсионныхРезервов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ДоходыИРасходыПенсионныхРезервов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	СписокФорм = ОтчетОбъект.ПолучитьСписокФормОтчета();
	
	Для Каждого ТекФорма Из СписокФорм Цикл
		Элементы.ФормаОтчета.СписокВыбора.Добавить(ТекФорма.Значение, ТекФорма.Представление);
	КонецЦикла;
	
	Параметры.Свойство("НастройкиОтчета", НастройкиОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписантаОтчета(Отчет, Отчет.Подписант, Отчет.Организация)
		ИЛИ Не ЗначениеЗаполнено(Отчет.Подписант)     
		Тогда
		РаботаСОтчетамиКлиентСервер.ЗаполнитьПодписанта(ЭтаФорма, Отчет.Организация);         
	КонецЕсли;	
	
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область ФОРМИРОВАНИЕ_ОТЧЕТОВ

&НаКлиенте
Процедура СформироватьОтчет()
	
	ЗаполнитьЗначенияСвойств(Отчет, НастройкиОтчета);
	
	ФормаОтчета = НастройкиОтчета.ФормаОтчета;
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета.Подписант) = Тип("Структура") Тогда
		Отчет.Подписант = ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
	Иначе
		Отчет.Подписант = ЭтаФорма.НастройкиОтчета.Подписант;
	КонецЕсли;
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета.ПодписантРуководитель) = Тип("Структура") Тогда
		Отчет.Руководитель = ЭтаФорма.НастройкиОтчета.ПодписантРуководитель.КонтактноеЛицо;
	Иначе
		Отчет.Руководитель = ЭтаФорма.НастройкиОтчета.ПодписантРуководитель;
	КонецЕсли;
	
	Если ЭтаФорма.НастройкиОтчета.Свойство("ПриобретенныеДо21082014") Тогда
		
		Если ЭтаФорма.НастройкиОтчета.ПриобретенныеДо21082014 Тогда
			Вариант5РПР = 1;
		Иначе
			Вариант5РПР = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Неопределено;
	
	СформироватьНаСервере(Результат);
	
	РезультатОтчета = Результат;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(Результат)
	
	ДополнительныеПараметры = Неопределено;
	
	Если ФормаОтчета = "5РПР" Тогда
		ДополнительныеПараметры = Новый Структура("Вариант", Вариант5РПР);
	КонецЕсли;
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СформироватьОтчет(Результат, ФормаОтчета, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере(РезультатОтчета);
		Элементы.Результат.ИспользуемоеИмяФайла = РаботаСоСтрокамиКлиентСервер.УдалитьНедопустимыеСимволыИмениФайла(Строка(Отчет.СчетДоверительногоУправления) + " (" + СтрЗаменить(Элементы.ФормаОтчета.ТекстРедактирования, " (форма УК)", "") + ") " + СтрЗаменить(ПредставлениеПериода(Отчет.Период.ДатаНачала, Отчет.Период.ДатаОкончания), ".", ""));		
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаСервере
Процедура НастроитьВидимостьИДоступность()
	
	Элементы.Вариант5РПР.Видимость	= ФормаОтчета = "5РПР";
	Элементы.Руководитель.Видимость	= ФормаОтчета = "ОтчетОФинансовомРезультатеДУ"
										ИЛИ ФормаОтчета = "РегистрУчетаПрочихРасходовОтРазмещенияПенсионныхРезервов";
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОтчетаПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");	
	НастроитьВидимостьИДоступность();	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("Строка")
		И (Расшифровка = "Форма 9 ДПР"
			ИЛИ Расшифровка = "Форма 10 ДПР"
			ИЛИ Расшифровка = "Форма 11 ДПР") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ФормаРасшифровки	= СтрЗаменить(СтрЗаменить(Расшифровка, "Форма ", ""), " ДПР", "") + "ДПР";
		ИмяОбъекта			= Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".", , , 2) - 1);
		
		ПараметрыРасшифровки = Новый Структура;
		ПараметрыРасшифровки.Вставить("Период",							Отчет.Период);
		ПараметрыРасшифровки.Вставить("Организация",					Отчет.Организация);
		ПараметрыРасшифровки.Вставить("СчетДоверительногоУправления",	Отчет.СчетДоверительногоУправления);
		ПараметрыРасшифровки.Вставить("Подписант",						Отчет.Подписант);
		ПараметрыРасшифровки.Вставить("ФормаОтчета",					ФормаРасшифровки);
		
		НоваяФорма = ОткрытьФорму(ИмяОбъекта + ".Форма.ФормаОтчета", Новый Структура("НастройкиОтчета", ПараметрыРасшифровки), , Новый УникальныйИдентификатор);
		
		НоваяФорма.СформироватьОтчет();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)

	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура РуководительПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура РуководительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантНачалоВыбора(ЭтаФорма, Элемент, Отчет.Руководитель, Отчет.Организация, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура РуководительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ЭтаФорма.СтруктураДанныхКонтактногоЛицаРуководитель, Отчет.Организация);
		
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	 РаботаСОтчетамиКлиент.ПодписантНачалоВыбора(ЭтаФорма, Элемент, Отчет.Подписант, Отчет.Организация, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ЭтаФорма.СтруктураДанныхКонтактногоЛица, Отчет.Организация);
	
КонецПроцедуры

#КонецОбласти
